---
kind: property
id: P:Autodesk.Revit.DB.FillGrid.Offset
zh: 偏移、偏移量
source: html/504406ea-b0a3-69af-82b4-b96cfdc85dd8.htm
---
# Autodesk.Revit.DB.FillGrid.Offset Property

**中文**: 偏移、偏移量

Gets and sets the offset of the fill grid.

## Syntax (C#)
```csharp
public double Offset { get; set; }
```

## Remarks
Offset defines the distance between parallel lines. A zero offset is not allowed.